-- 插入正确的角色数据
SET search_path TO master;

INSERT INTO sys_role (role_id, tenant_id, role_name, role_key, role_sort, data_scope, menu_check_strictly, dept_check_strictly, status, del_flag, create_dept, create_by, create_time, remark, create_name) VALUES
(681697043340592389, '000000', '演示角色', 'ysRole', 0, '1', true, true, '0', '0', '103', '1', '2025-04-15', '', '系统'),
(609929994495329541, '000000', '节能中心', 'jnzx', 0, '1', true, true, '0', '0', '103', '1', '2024-10-29', '', '系统'),
(538193675855856901, '000000', '市政质监站', 'szrole', 0, '1', true, true, '0', '0', '103', '1', '2024-03-15', '', '系统'),
(312401917948986629, '000000', '市安监局人员', 'sajjry', 0, '1', true, true, '0', '0', '103', '1', '2022-06-01', '', '系统'),
(305829674242540805, '000000', '供应商人员', 'gysjs', 0, '1', true, true, '0', '0', '103', '1', '2022-06-13', '', '系统'),
(296504242699502853, '000000', '造价处管理员', 'zjcgul', 0, '1', true, true, '0', '0', '103', '1', '2023-08-15', '', '系统'),
(286695256735352069, '000000', '建材系统管理员', 'sysadmin', 0, '1', true, true, '0', '0', '103', '1', '2021-12-21', '', '系统'),
(276202336936789253, '000000', '建管中心人员', 'jgzx', 0, '1', true, true, '0', '0', '103', '1', '2022-02-20', '', '系统'),
(275855349104248069, '000000', '施工单位人员', 'sgdwry', 0, '1', true, true, '0', '0', '103', '1', '2022-02-19', '', '系统'),
(275393296988112133, '000000', '生产单位人员', 'scdwry', 0, '1', true, true, '0', '0', '103', '1', '2022-02-18', '', '系统');

SELECT * FROM sys_role WHERE role_id > 1000000000;